iarsystems/ewarm-toshiba-example-projects/TMPM3HPA/Libraries/startup/startup_TMPM3HPA.s
                PUBWEAK INTT32A07CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07CCAP1_IRQHandler
                B       INTT32A07CCAP1_IRQHandler

                PUBWEAK INTPARI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPARI_IRQHandler
                B       INTPARI_IRQHandler

                PUBWEAK INTDMAATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAATC_IRQHandler
                B       INTDMAATC_IRQHandler

                PUBWEAK INTDMAAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAAERR_IRQHandler
                B       INTDMAAERR_IRQHandler

                PUBWEAK INTDMABTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMABTC_IRQHandler
                B       INTDMABTC_IRQHandler

                PUBWEAK INTDMABERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMABERR_IRQHandler
                B       INTDMABERR_IRQHandler

                PUBWEAK INTRTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRTC_IRQHandler
                B       INTRTC_IRQHandler

                PUBWEAK INTRMC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRMC0_IRQHandler
                B       INTRMC0_IRQHandler

                PUBWEAK INTFLCRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLCRDY_IRQHandler
                B       INTFLCRDY_IRQHandler

                PUBWEAK INTFLDRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLDRDY_IRQHandler
                B       INTFLDRDY_IRQHandler

                PUBWEAK INTLCDBUSF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTLCDBUSF_IRQHandler
                B       INTLCDBUSF_IRQHandler

                PUBWEAK INTLCDSTOP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTLCDSTOP_IRQHandler
                B       INTLCDSTOP_IRQHandler

                PUBWEAK INTUART6RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART6RX_IRQHandler
                B       INTUART6RX_IRQHandler

                PUBWEAK INTUART6TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART6TX_IRQHandler
                B       INTUART6TX_IRQHandler

                PUBWEAK INTUART6ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART6ERR_IRQHandler
                B       INTUART6ERR_IRQHandler

                PUBWEAK INTUART7RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART7RX_IRQHandler
                B       INTUART7RX_IRQHandler

                PUBWEAK INTUART7TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART7TX_IRQHandler
                B       INTUART7TX_IRQHandler

                PUBWEAK INTUART7ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART7ERR_IRQHandler
                B       INTUART7ERR_IRQHandler

                END
